ruby/app/controllers/attendance_controller.rb

SELECT id, attendance_number, user_name FROM `users` WHERE `users`.`fiscal_year` = 2018
SELECT  `days`.`date` FROM `days` WHERE `days`.`school_day` = TRUE AND `days`.`date` BETWEEN '2018-05-01' AND '2018-05-31' LIMIT 1
SELECT id, user_id, date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at FROM `attendances` WHERE `attendances`.`date` BETWEEN '2018-05-01' AND '2018-05-31' ORDER BY date ASC
---
  def atndsAllStudents
    usersSc = User.select('id, attendance_number, user_name').where(fiscal_year: 2018)
    usersSc = usersSc.map{ |u| u.attributes }
    usersCc = Array.new()
    for user in usersSc
      user = user.map{ |k, v| [k.camelize(:lower), v] }.to_h
      usersCc.push(user)
    end

    dates = Day.select('date').where(school_day: true, date: (params[:year] + '-' + params[:month] + '-01').to_date.all_month).pluck(:date)

    atndsSc = Attendance.select('id, user_id, date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at').where(date: (dates[0])..(dates[dates.length - 1]))

SELECT `days`.`date` FROM `days` WHERE `days`.`school_day` = TRUE AND `days`.`date` BETWEEN '2018-06-01' AND '2018-06-30'
SELECT date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at FROM `attendances` WHERE `attendances`.`user_id` = 1 AND `attendances`.`date` BETWEEN '2018-05-01' AND '2018-05-31' ORDER BY date asc
---
  def atndsOneStudent
    user = User.select('id, attendance_number, user_name').find_by(fiscal_year: 2018, id: params[:student]).attributes

    dates = Day.select('date').where(school_day: true, date: (params[:year] + '-' + params[:month] + '-01').to_date.all_month).pluck(:date)

    atndsSc = Attendance.select('date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at')
                .where(user_id: params[:student], date: (dates[0])..(dates[dates.length - 1]))