ruby/app/controllers/attendance_controller.rb

SELECT id, attendance_number, user_name FROM `users` WHERE `users`.`fiscal_year` = 2018
SELECT `days`.`date` FROM `days` WHERE `days`.`school_day` = TRUE AND `days`.`date` BETWEEN '2018-05-01' AND '2018-05-31'
SELECT COUNT(*) FROM `days` WHERE `days`.`school_day` = TRUE AND `days`.`date` BETWEEN '2018-05-01' AND '2018-05-31'
SELECT id, user_id, date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at FROM `attendances` WHERE `attendances`.`date` >= '2018-05-01' AND `attendances`.`date` < '2018-05-09'
SELECT id, user_id, date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at FROM `attendances` WHERE `attendances`.`date` BETWEEN '2018-05-01' AND '2018-05-31' ORDER BY date ASC
---
  def atnds_all_students
    usersSc = User.select('id, attendance_number, user_name').where(fiscal_year: 2018)
    usersSc = usersSc.map{ |u| u.attributes }
    usersCc = Array.new()
    for user in usersSc
      user = user.map{ |k, v| [k.camelize(:lower), v] }.to_h
      usersCc.push(user)
    end

    dates = Day.select('date').where(school_day: true, date: (params[:year] + '-' + params[:month] + '-01').to_date.all_month).pluck(:date)

    atndsSc = Attendance.select('id, user_id, date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at')
                .where(date: (dates[0])..(dates[dates.length - 1])).order('date ASC')
    atndsSc = atndsSc.map{ |u| u.attributes }

SELECT  id, attendance_number, user_name FROM `users` WHERE `users`.`fiscal_year` = 2018 AND `users`.`id` = 1 LIMIT 1
SELECT `days`.`date` FROM `days` WHERE `days`.`school_day` = TRUE AND `days`.`date` BETWEEN '2018-05-01' AND '2018-05-31'
SELECT date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at FROM `attendances` WHERE `attendances`.`user_id` = 1 AND `attendances`.`date` BETWEEN '2018-05-01' AND '2018-05-31'
SELECT date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at FROM `attendances` WHERE `attendances`.`user_id` = 1 AND `attendances`.`date` BETWEEN '2018-05-01' AND '2018-05-31' ORDER BY date asc
---
  def atnds_one_student
    user = User.select('id, attendance_number, user_name').find_by(fiscal_year: 2018, id: params[:student]).attributes

    dates = Day.select('date').where(school_day: true, date: (params[:year] + '-' + params[:month] + '-01').to_date.all_month).pluck(:date)

    atndsSc = Attendance.select('date, atnd1, atnd2, atnd3, atnd4, atnd5, came_at, leaved_at')
                .where(user_id: params[:student], date: (dates[0])..(dates[dates.length - 1])).order('date asc')
    atndsSc = atndsSc.map{ |u| u.attributes }

SELECT  `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 1 AND `attendances`.`date` = '2018-05-08' LIMIT 1
UPDATE `attendances` SET `atnd4` = 2, `updated_at` = '2018-05-31 14:01:24' WHERE `attendances`.`id` = 46
INSERT INTO `attendances` (`user_id`, `date`, `atnd1`, `atnd2`, `atnd3`, `atnd4`, `atnd5`, `created_at`, `updated_at`) VALUES (1, '2018-05-08', 6, 6, 6, 6, 6, '2018-06-01 00:36:27', '2018-06-01 00:36:27')
UPDATE `attendances` SET `atnd2` = 0, `updated_at` = '2018-05-31 23:53:59' WHERE `attendances`.`id` = 46
---
  def update_attendance
    state = JSON.parse(request.body.read).to_a
    atnd = Attendance.find_by(user_id: params[:student], date: params[:date])
    if atnd == nil
      atnd = Attendance.new(user_id: params[:student], date: params[:date], atnd1: 6, atnd2: 6, atnd3: 6, atnd4: 6, atnd5: 6)
      atnd.save
    end
    atnd.update(state[0][0] => state[0][1])