ruby/app/controllers/school_days_controller.rb

SELECT  `days`.* FROM `days` ORDER BY `days`.`date` ASC LIMIT 1
INSERT INTO `days` (`date`, `school_day`, `created_at`, `updated_at`) VALUES ('2018-04-01', FALSE, '2018-06-03 03:06:16', '2018-06-03 03:06:16')
SELECT `days`.* FROM `days` WHERE `days`.`date` = '2018-04-01'
UPDATE `days` SET `school_day` = FALSE, `updated_at` = '2018-06-03 08:07:42' WHERE `days`.`date` = '2019-02-22'
---
  def add

    dates = [*(((params[:fiscalYear] + '-04-01').to_date)..(((params[:fiscalYear].to_i + 1).to_s + '-04-01').to_date)).to_a]
              .map{ |date, bool| [date, (
                (params[:firstTermStartDate].to_date <= date && date <= params[:firstTermLastDate].to_date) ||
                (params[:latterTermStartDate].to_date <= date && date <= params[:latterTermLastDate].to_date)
              )] }.to_h
              .map{ |date, bool| [date, ( bool && !(date.wday == 0 || date.wday == 6) )] }.to_h
              .map{ |date, bool| [date, ( bool && !(HolidayJp.holiday?(date)) )] }.to_h

    if Day.first.blank?
      dates.each do |date, bool|
        day = Day.new(date: date, school_day: bool)
        day.save
      end
    else
      dates.each{ |date, bool| Day.where(date: date).update(school_day: bool) }